//TONYWN1 JOB (NFSD),'MAKE DINO-NFS',
//      CLASS=A,MSGCLASS=X,MSGLEVEL=1,REGION=8M,
//      NOTIFY=TONYW
//*
//CL1 EXEC GCCCL,INFILE='TONYW.DINONFS.C(NFSD)'
//COMP.INCLUDE DD
//             DD DISP=SHR,DSN=TONYW.DINONFS.H
//LKED.SYSLMOD DD DISP=SHR,DSN=TONYW.DINONFS.LOAD
//LKED.SYSIN DD *
   NAME NFSD(R)
//
