//TONYWA3 JOB (NFSD),'MAKE MVSSTOW',
//      CLASS=A,MSGCLASS=X,MSGLEVEL=1,REGION=8M,
//      NOTIFY=TONYW
//*
//* Assemble + link-edit the BLDL/FIND/STOW ISPF-stats helper (mvs_stow)
//* into the NFSD load library, the same way GETCIB is built (mkgetcib.jcl).
//*
//MVSSTOW EXEC ASMFCL,MAC1='SYS1.AMODGEN',MAC2='SYS2.MACLIB',
//        PARM.ASM=(OBJ,NODECK)
//ASM.SYSPUNCH DD SYSOUT=*
//ASM.SYSIN    DD DISP=SHR,DSN=TONYW.NFSD.ASM(MVSSTOW)
//LKED.SYSLMOD DD DISP=SHR,DSN=TONYW.NFSD.LOAD
//LKED.SYSIN   DD *
    NAME MVSSTOW(R)
//
